

. clear

. 
. set linesize 255

. set obs 500
number of observations (_N) was 0, now 500

. set seed 12345678

. if c(MP) {
.     qui set processor 1
. }

. 
. global EDM_VERBOSITY=0

. global EDM_NTHREADS=4

. global EDM_SEED=1234

. 
. gen t = _n

. tsset t
        time variable:  t, 1 to 500
                delta:  1 unit

. 
. gen double x = 0.2 if _n==1
(499 missing values generated)

. gen double y = 0.4 if _n==1
(499 missing values generated)

. 
. * Create a dynamic system
. local r_x 3.625

. local r_y 3.77

. local beta_xy = 0.05

. local beta_yx=0.4

. local tau = 1

. drawnorm double u1 u2

. qui {

. 
. * burn the first 300 observations
. keep in 300/500
(299 observations deleted)

. 
. * Determining the complexity of the system
. 
. * identify optimal E
. edm explore x, e(2/10)

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99889        .0062098 
                 3               1          .99893        .0067939 
                 4               1          .99829        .0085469 
                 5               1          .99796        .0096191 
                 6               1           .9963         .013004 
                 7               1          .99592         .013757 
                 8               1           .9937         .016582 
                 9               1           .9923         .018526 
                10               1          .98515         .025872 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm xmap x y, k(5)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .55861          .12802 
   x ~ x|M(y)             200          .94454         .048853 
---------------------------------------------------------------
Note: Number of neighbours (k) is adjusted to 5
Note: The embedding dimension E is 2

. 
. // TODO: It sometimes crashed on this next line; look closer if not already fixed.
. edm xmap x y, e(6) lib(8)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)               8          .34021          .20047 
   x ~ x|M(y)               8          .61506          .14131 
---------------------------------------------------------------
Note: The embedding dimension E is 6

. 
. edm explore x, k(5) crossfold(10)
10-fold cross-validation progress (10 in total)
..........

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
----------------------------------------------------------------------
                      --------- rho ---------  --------- MAE ---------
 Actual E    theta         Mean    Std. Dev.         Mean    Std. Dev.
----------------------------------------------------------------------
        2        1        .9994    .00039904     .0051242     .0016009
----------------------------------------------------------------------
Note: Results from 10 runs
Note: Number of neighbours (k) is adjusted to 5
Note: 10-fold cross validation results reported

. 
. edm explore x, theta(0.2(0.1)2.0) algorithm(smap)

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2              .2          .99928        .0052195 
                 2              .3          .99926        .0052278 
                 2              .4          .99925        .0052341 
                 2              .5          .99924        .0052388 
                 2              .6          .99922         .005242 
                 2              .7          .99921        .0052438 
                 2              .8           .9992        .0052448 
                 2              .9          .99919        .0052505 
                 2               1          .99917        .0052584 
                 2             1.1          .99916        .0052687 
                 2             1.2          .99915        .0052853 
                 2             1.3          .99914         .005303 
                 2             1.4          .99913        .0053211 
                 2             1.5          .99912        .0053395 
                 2             1.6          .99912         .005358 
                 2             1.7          .99911        .0053766 
                 2             1.8           .9991        .0053953 
                 2             1.9          .99909        .0054142 
                 2               2          .99908        .0054337 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+2
Note: Random 50/50 split for training and validation data

. 
. edm xmap x y, theta(0.2) algorithm(smap) savesmap(beta)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .66867          .11052 
   x ~ x|M(y)             200          .98487         .018655 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert beta1_b2_rep1 !=. if _n>1

. 
. edm xmap y x, predict(x2) direction(oneway)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             200          .94272         .048213 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert x2 !=. if _n>1

. 
. edm explore x, copredict(teste) copredictvar(y)

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99825        .0082466 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. assert teste!=. if _n>1

. 
. edm explore z.x, tp(10)

Empirical Dynamic Modelling
Univariate mapping with z.x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .91637          .32112 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm xmap y x, tp(10) direction(oneway)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .89554         .068441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. 
. edm xmap y x, tp(10) copredict(testx) copredictvar(x2 y) direction(oneway)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .89554         .068441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert testx!=. if _n>2

. 
. edm xmap y x, tp(10) copredict(testx2) copredictvar(z.x2 z.y) direction(oneway)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .89554         .068441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert testx2 !=. if _n>2

. 
. edm xmap y x, extra(u1) tp(10) copredict(testx3) copredictvar(z.x2 z.y) direction(oneway)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
Additional variable in the embedding: u1
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .37011          .16613 
---------------------------------------------------------------
Note: The embedding dimension E is 3 (including 1 extra)

. assert testx3 !=. if _n>2

. 
. * check explore / xmap consistency
. 
. edm xmap l.x x, direction(oneway)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables l.x and x
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
     x ~ x|M(l.x)             199          .99939        .0049147 
-------------------------------------------------------------------
Note: The embedding dimension E is 2

. mat xmap_r=e(b)

. edm explore x, full

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99939        .0049147 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. mat explore_r =e(b)

. assert xmap_r[1,1] == explore_r[1,1]

. 
. * check xmap reverse consistency
. 
. edm xmap x y

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .54213          .13182 
   x ~ x|M(y)             200          .94272         .048213 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. mat xmap1 = e(b)

. edm xmap y x

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             200          .94272         .048213 
   y ~ y|M(x)             200          .54213          .13182 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. * TODO: Fix the following asserts, which are considered syntax errors in Stata15 (on Mac).
. * assert e(b)[1,1] == xmap1[1,2]
. * assert e(b)[1,2] == xmap1[1,1]
. 
. tempfile basedata

. qui compress

. qui save `basedata', replace

. * test missing data
. set seed 12345678

. gen double u = runiform()

. drop if u<0.1
(19 observations deleted)

. replace x = . if u<0.2
(22 real changes made, 22 to missing)

. replace t=. if mod(t,19) ==1
(11 real changes made, 11 to missing)

. 
. edm explore x

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .98278         .022696 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. edm explore x, dt

Empirical Dynamic Modelling
Multivariate mapping with x and its lag values
Additional variables in the embedding: (time delta)
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 3               1          .52731          .14419 
--------------------------------------------------------------------
Note: Actual E is higher than the specified E due to extras
Note: Number of neighbours (k) is set to E+2
Note: Random 50/50 split for training and validation data
Note: Embedding includes the delta of the time variable with a weight of .36

. 
. edm explore x, allowmissing

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
Missing values are assumed to have a distance of .25 with all values.
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99653         .011767 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. edm explore x, missingdistance(2)

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
Missing values are assumed to have a distance of 2 with all values.
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99652         .011775 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. edm xmap x l.x, allowmissing

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l.x
Missing values are assumed to have a distance of .25 with all values.
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
   l.x ~ l.x|M(x)             124           .9998        .0027684 
     x ~ x|M(l.x)             118           .9983        .0093729 
-------------------------------------------------------------------
Note: The embedding dimension E is 2

. edm xmap x l.x, missingdistance(2)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l.x
Missing values are assumed to have a distance of 2 with all values.
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
   l.x ~ l.x|M(x)             124           .9998        .0027686 
     x ~ x|M(l.x)             118           .9983        .0093764 
-------------------------------------------------------------------
Note: The embedding dimension E is 2

. 
. edm xmap x l.x, extraembed(u) allowmissing dt alg(smap) savesmap(newb) e(5)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l.x
Additional variables in the embedding: u (+ time delta)
Missing values are assumed to have a distance of .25 with all values.
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
   l.x ~ l.x|M(x)             124          .88581         .056787 
     x ~ x|M(l.x)             150          .22176          .30935 
-------------------------------------------------------------------
Note: The embedding dimension E is 10 (including 5 extras)
Note: Embedding includes the delta of the time variable with a weight of .55 and .54

. 
. edm xmap x l3.x, extraembed(u) allowmissing dt alg(smap) savesmap(newc) e(5) oneway dtsave(testdt)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l3.x
Additional variables in the embedding: u (+ time delta)
Missing values are assumed to have a distance of .25 with all values.
---------------------------------------------------------------------
            Mapping    Library size             rho             MAE
---------------------------------------------------------------------
   l3.x ~ l3.x|M(x)             123          .69907         .075825 
---------------------------------------------------------------------
Note: The embedding dimension E is 10 (including 5 extras)
Note: Embedding includes the delta of the time variable with a weight of .55

. 
. edm explore x, extraembed(u) allowmissing dt crossfold(5)
5-fold cross-validation progress (5 in total)
.....

Empirical Dynamic Modelling
Multivariate mapping with x and its lag values
Additional variables in the embedding: u (+ time delta)
Missing values are assumed to have a distance of .25 with all values.
----------------------------------------------------------------------
                      --------- rho ---------  --------- MAE ---------
 Actual E    theta         Mean    Std. Dev.         Mean    Std. Dev.
----------------------------------------------------------------------
        4        1       .59577       .13963       .12558      .018046
----------------------------------------------------------------------
Note: Results from 5 runs
Note: Actual E is higher than the specified E due to extras
Note: Number of neighbours (k) is set to E+3
Note: 5-fold cross validation results reported
Note: Embedding includes the delta of the time variable with a weight of .55

. 
. edm explore d.x, dt

Empirical Dynamic Modelling
Multivariate mapping with d.x and its lag values
Additional variables in the embedding: (time delta)
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 3               1          .79131          .16863 
--------------------------------------------------------------------
Note: Actual E is higher than the specified E due to extras
Note: Number of neighbours (k) is set to E+2
Note: Random 50/50 split for training and validation data
Note: Embedding includes the delta of the time variable with a weight of .27

. 
. edm explore x, rep(20) ci(95)
Replication progress (20 in total)
....................

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
----------------------------------------------------------------------
                      --------- rho ---------  --------- MAE ---------
 Actual E    theta         Mean    Std. Dev.         Mean    Std. Dev.
----------------------------------------------------------------------
        2        1       .99361      .006014       .01567     .0049227
  Est. mean 95% CI   [    .9908,    .99643 ]   [  .013366,   .017974 ]
2.5/97.5 Pc (Est.)   [   .98182,    1.0054 ]   [  .006022,   .025318 ]
2.5/97.5 Pc (Obs.)   [   .98179,    .99858 ]   [ .0098646,   .023745 ]
----------------------------------------------------------------------
Note: Results from 20 runs
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm xmap x y, lib(50) rep(20) ci(95)
Replication progress (40 in total)
........................................

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping        Lib size        Mean rho       Std. Dev.
---------------------------------------------------------------
   y ~ y|M(x)              50          .40023         .047519
  Est. mean 95% CI                    [   .37799,    .42247 ]
2.5/97.5 Pc (Est.)                    [   .30709,    .49337 ]
2.5/97.5 Pc (Obs.)                    [   .30472,    .46414 ]
   x ~ x|M(y)              50          .86556         .024863
  Est. mean 95% CI                    [   .85393,     .8772 ]
2.5/97.5 Pc (Est.)                    [   .81683,    .91429 ]
2.5/97.5 Pc (Obs.)                    [   .80396,    .90771 ]
---------------------------------------------------------------
Note: Results from 20 replications
Note: The embedding dimension E is 2

. 
. use `basedata', clear

. cap drop x_copy

. cap drop x_p

. cap drop xc_p

. clonevar x_copy = x

. edm explore x, predict(x_p) copredict(xc_p) copredictvar(x_copy) full

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99939        .0049147 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. assert x_p!=. if _n!=1 & _n!=_N

. assert xc_p!=. if _n!=1 & _n!=_N

. assert x_p ==xc_p if x_p!=.

. cor x_p f.x
(obs=199)

             |                 F.
             |      x_p        x
-------------+------------------
         x_p |   1.0000
           x |
         F1. |   0.9994   1.0000


. cor xc_p f.x
(obs=199)

             |                 F.
             |     xc_p        x
-------------+------------------
        xc_p |   1.0000
           x |
         F1. |   0.9994   1.0000


. 
. cap drop x_p xc_p

. edm explore x, predict(x_p) copredict(xc_p) copredictvar(x_copy) full tp(2)

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99877        .0078776 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. sum x_p xc_p

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         x_p |        198    .6434232    .2159587   .3039276   .8967989
        xc_p |        200    .6436226    .2154685   .3039276   .8967989

. assert xc_p!=. if x_p!=.

. 
. gen y_copy = y

. edm xmap x y, tp(10) copredict(xmap_y_p) copredictvar(x_copy y_copy) direction(oneway) predict(xmap_y)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             190          .30665          .15441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert xmap_y_p !=. if _n>1

. assert xmap_y_p == xmap_y if xmap_y !=.

. 
. preserve

. drop if mod(t,17)==1
(12 observations deleted)

. //copredict with dt
. edm xmap x y, dt copredict(xmap_y_p_dt) copredictvar(x_copy y_copy) direction(oneway) predict(xmap_y_dt)

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
Additional variables in the embedding: (time delta)
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             188          .51527          .13499 
---------------------------------------------------------------
Note: The embedding dimension E is 3 (including 1 extra)
Note: Embedding includes the delta of the time variable with a weight of .88

. assert xmap_y_p_dt !=. if _n>1

. assert xmap_y_p_dt == xmap_y_dt if xmap_y_dt !=.

. 
. edm explore x, predict(predicted_x_dt) copredict(predicted_x_copy_dt) copredictvar(x_copy) full

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99928        .0054303 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. 
. assert predicted_x_dt == predicted_x_copy_dt if predicted_x_dt!=.

. 
. restore

. 
. edm explore x, copredict(dx2) copredictvar(d.x)

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99825        .0082466 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm explore x, predict(predicted_x) copredict(predicted_y_from_mx) copredictvar(y) full

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99939        .0049147 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. edm explore y, predict(predicted_y) full

Empirical Dynamic Modelling
Univariate mapping with y and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99279          .01359 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. cor f.x f.y predicted_x predicted_y predicted_y_from_mx
(obs=199)

             |        F.       F.                           
             |        x        y predi~_x predic~y predi~mx
-------------+---------------------------------------------
           x |
         F1. |   1.0000
           y |
         F1. |   0.3545   1.0000
 predicted_x |   0.9994   0.3467   1.0000
 predicted_y |   0.3618   0.9928   0.3540   1.0000
predicted~mx |   0.1334   0.7831   0.1217   0.7850   1.0000


. cor f.x predicted_x
(obs=199)

             |        F.         
             |        x predi~_x
-------------+------------------
           x |
         F1. |   1.0000
 predicted_x |   0.9994   1.0000


. assert r(rho)>0.99

. cor f.y predicted_y
(obs=199)

             |        F.         
             |        y predic~y
-------------+------------------
           y |
         F1. |   1.0000
 predicted_y |   0.9928   1.0000


. assert r(rho)>0.99

. cor f.y predicted_y_from_mx
(obs=199)

             |        F.         
             |        y predi~mx
-------------+------------------
           y |
         F1. |   1.0000
predicted~mx |   0.7831   1.0000


. assert r(rho)>0.7

. 
. * Obtaining CI of the xmap
. jackknife: edm xmap x y, e(2)
(running edm on estimation sample)

Jackknife replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .54213          .13182 
   x ~ x|M(y)             200          .94272         .048213 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. ereturn display
------------------------------------------------------------------------------
             |              Jackknife
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y|M(x) |    .542135   .0914957     5.93   0.000     .3617095    .7225605
      x|M(y) |   .9427227   .0140109    67.29   0.000     .9150939    .9703515
------------------------------------------------------------------------------

. 
. jackknife: edm explore x, e(2)
(running edm on estimation sample)

Jackknife replications (199)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
.................................................

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99825        .0082466 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. ereturn display
------------------------------------------------------------------------------
             |              Jackknife
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .9982506   .0087708   113.82   0.000     .9809544    1.015547
------------------------------------------------------------------------------

. 
end of do-file
