
. 
. set obs 500
number of observations (_N) was 0, now 500

. set seed 12345678

. 
. global EDM_VERBOSITY=1

. global EDM_NTHREADS=4

. 
. gen t = _n

. tsset t
        time variable:  t, 1 to 500
                delta:  1 unit

. 
. gen double x = 0.2 if _n==1
(499 missing values generated)

. gen double y = 0.4 if _n==1
(499 missing values generated)

. 
. * Create a dynamic system
. local r_x 3.625

. local r_y 3.77

. local beta_xy = 0.05

. local beta_yx=0.4

. local tau = 1

. drawnorm double u1 u2

. qui {

. 
. * burn the first 300 observations
. keep in 300/500
(299 observations deleted)

. 
. 
. 
. * Determining the complexity of the system
. 
. * identify optimal E
. 
. edm explore x, e(2/10) saveinputs(test1.h5)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 8, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 4
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 3
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 3

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 4
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 4

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 10, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 6
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 5
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 5

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 6

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 11, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 7
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 6
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 6

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 7

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 12, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 8
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 7
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 7

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 8

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 13, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 9
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 8
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 8

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 9

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 14, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 10
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 9
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 9

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 10

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 15, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 11
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 10
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1
arg 11: test1.h5

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 10

train set obs: 95
predict set obs: 96

p_manifold flag = 0

l = 11

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99838         .008126 
                 3               1          .99777          .01015 
                 4               1          .99726         .011441 
                 5               1          .99707         .012625 
                 6               1          .99397          .01607 
                 7               1          .99222         .018344 
                 8               1          .98998         .021055 
                 9               1          .98896         .022099 
                10               1          .98566          .02446 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm xmap x y, k(5)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .55861          .12802 
   x ~ x|M(y)             200          .94454         .048853 
---------------------------------------------------------------
Note: Number of neighbours (k) is adjusted to 5
Note: The embedding dimension E is 2

. 
. edm xmap x y, e(6) lib(8) 

====================
Start of the plugin

number of vars & obs = 11, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 7
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 6
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 6

train set obs: 8
predict set obs: 196

p_manifold flag = 0

l = 7

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 11, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 7
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 6
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 6

train set obs: 8
predict set obs: 196

p_manifold flag = 0

l = 7

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)               8          .34074          .15729 
   x ~ x|M(y)               8           .5642          .16437 
---------------------------------------------------------------
Note: The embedding dimension E is 6

. 
. edm explore x, k(5) crossfold(10)
10-fold cross-validation progress (10 in total)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 180
predict set obs: 19

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 179
predict set obs: 20

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
----------------------------------------------------------------------
                      --------- rho ---------  --------- MAE ---------
 Actual E    theta         Mean    Std. Dev.         Mean    Std. Dev.
----------------------------------------------------------------------
        2        1       .99939    .00028279     .0051435     .0012207
----------------------------------------------------------------------
Note: Results from 10 runs
Note: Number of neighbours (k) is adjusted to 5
Note: 10-fold cross validation results reported

. 
. edm explore x, theta(0.2(0.1)2.0) algorithm(smap)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .2
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.2000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .3
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.3000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .4
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.4000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .5
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.5000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .6
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.6000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .7
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.7000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .8
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.8000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: .9
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 0.9000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.1
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.1000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.2
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.2000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.3
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.3000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.4
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.4000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.5
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.5000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.6
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.6000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.7
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.7000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.8
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.8000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1.9
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.9000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 2
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 2.0000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2              .2          .99945        .0041219 
                 2              .3          .99946        .0040956 
                 2              .4          .99946        .0040696 
                 2              .5          .99947        .0040449 
                 2              .6          .99947        .0040294 
                 2              .7          .99947        .0040157 
                 2              .8          .99948        .0040043 
                 2              .9          .99948        .0039953 
                 2               1          .99948        .0039876 
                 2             1.1          .99948        .0039823 
                 2             1.2          .99948        .0039795 
                 2             1.3          .99948        .0039776 
                 2             1.4          .99948        .0039776 
                 2             1.5          .99948        .0039776 
                 2             1.6          .99948        .0039773 
                 2             1.7          .99947        .0039766 
                 2             1.8          .99947        .0039761 
                 2             1.9          .99946        .0039839 
                 2               2          .99946        .0039918 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+2
Note: Random 50/50 split for training and validation data

. 
. edm xmap x y, theta(0.2) algorithm(smap) savesmap(beta)

====================
Start of the plugin

number of vars & obs = 10, 201
first and last obs in sample = 1, 201

arg 0: .2
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 1
arg 8: 3
arg 9: 4
arg 10: 1

theta = 0.2000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 4

columns in smap coefficents = 3
save_mode = 1

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 10, 201
first and last obs in sample = 1, 201

arg 0: .2
arg 1: 4
arg 2: smap
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 1
arg 8: 3
arg 9: 4
arg 10: 1

theta = 0.2000

algorithm = smap

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 4

columns in smap coefficents = 3
save_mode = 1

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .66867          .11052 
   x ~ x|M(y)             200          .98487         .018655 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert beta1_b2_rep1 !=. if _n>1

. 
. 
. 
. edm xmap y x, predict(x2) direction(oneway)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             200          .94272         .048213 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert x2 !=. if _n>1

. 
. edm explore x, copredict(teste) copredictvar(y)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 200

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99902        .0065958 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. assert teste!=. if _n>1

. 
. edm explore z.x, tp(10)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 95
predict set obs: 95

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with z.x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1           .9163          .32768 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm xmap y x, tp(10) direction(oneway)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 190
predict set obs: 190

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .89554         .068441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. 
. edm xmap y x, tp(10) copredict(testx) copredictvar(x2 y) direction(oneway)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 190
predict set obs: 190

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 190
predict set obs: 199

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .89554         .068441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert testx!=. if _n>2

. 
. 
. edm xmap y x, tp(10) copredict(testx2) copredictvar(z.x2 z.y) direction(oneway)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 190
predict set obs: 190

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 190
predict set obs: 199

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .89554         .068441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert testx2 !=. if _n>2

. 
. edm xmap y x, extra(u1) tp(10) copredict(testx3) copredictvar(z.x2 z.y) direction(oneway)

====================
Start of the plugin

number of vars & obs = 8, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 4
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 3
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 3

train set obs: 190
predict set obs: 190

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 11, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 4
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 3
arg 6: 1
arg 7: 0
arg 8: 3
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 3

train set obs: 190
predict set obs: 199

p_manifold flag = 1
number of variables in p_manifold = 3

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
Additional variable in the embedding: u1
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             190          .37011          .16613 
---------------------------------------------------------------
Note: The embedding dimension E is 3 (including 1 extra)

. assert testx3 !=. if _n>2

. 
. * check explore / xmap consistency
. 
. edm xmap l.x x, direction(oneway)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 199

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables l.x and x
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
     x ~ x|M(l.x)             199          .99939        .0049147 
-------------------------------------------------------------------
Note: The embedding dimension E is 2

. mat xmap_r=e(b)

. edm explore x, full

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 199

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99939        .0049147 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. mat explore_r =e(b)

. assert xmap_r[1,1] == explore_r[1,1]

. 
. 
. * check xmap reverse consistency
. 
. edm xmap x y

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .54213          .13182 
   x ~ x|M(y)             200          .94272         .048213 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. mat xmap1 = e(b)

. edm xmap y x

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 200
predict set obs: 200

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables y and x
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   x ~ x|M(y)             200          .94272         .048213 
   y ~ y|M(x)             200          .54213          .13182 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. * TODO: Fix the following asserts, which are considered syntax errors in Stata15 (on Mac).
. * assert e(b)[1,1] == xmap1[1,2]
. * assert e(b)[1,2] == xmap1[1,1]
. 
. tempfile basedata

. qui compress

. qui save `basedata', replace

. * test missing data
. set seed 12345678

. gen double u = runiform()

. drop if u<0.1
(19 observations deleted)

. replace x = . if u<0.2
(22 real changes made, 22 to missing)

. replace t=. if mod(t,19) ==1
(11 real changes made, 11 to missing)

. 
. 
. edm explore x

====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99627          .01523 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. edm explore x, dt

====================
Start of the plugin

number of vars & obs = 8, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 4
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 3
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 3

train set obs: 74
predict set obs: 74

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Multivariate mapping with x and its lag values
Additional variables in the embedding: (time delta)
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 3               1          .58186          .13183 
--------------------------------------------------------------------
Note: Actual E is higher than the specified E due to extras
Note: Number of neighbours (k) is set to E+2
Note: Random 50/50 split for training and validation data
Note: Embedding includes the delta of the time variable with a weight of .36

. 
. edm explore x, allowmissing

====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 2

train set obs: 59
predict set obs: 59

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
Missing values are assumed to have a distance of .25 with all values.
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99682         .011804 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. edm explore x, missingdistance(2)

====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 2
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 2.000000

number of variables in manifold = 2

train set obs: 59
predict set obs: 59

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
Missing values are assumed to have a distance of 2 with all values.
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99531          .01599 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. edm xmap x l.x, allowmissing

====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 2

train set obs: 124
predict set obs: 124

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 2

train set obs: 118
predict set obs: 118

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l.x
Missing values are assumed to have a distance of .25 with all values.
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
   l.x ~ l.x|M(x)             124           .9998        .0027684 
     x ~ x|M(l.x)             118           .9983        .0093729 
-------------------------------------------------------------------
Note: The embedding dimension E is 2

. edm xmap x l.x, missingdistance(2)

====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 2
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 2.000000

number of variables in manifold = 2

train set obs: 124
predict set obs: 124

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 2
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 2.000000

number of variables in manifold = 2

train set obs: 118
predict set obs: 118

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l.x
Missing values are assumed to have a distance of 2 with all values.
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
   l.x ~ l.x|M(x)             124           .9998        .0027686 
     x ~ x|M(l.x)             118           .9983        .0093764 
-------------------------------------------------------------------
Note: The embedding dimension E is 2

. 
. 
. edm xmap x l.x, extraembed(u) allowmissing dt alg(smap) savesmap(newb) e(5)

====================
Start of the plugin

number of vars & obs = 26, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 9
arg 2: smap
arg 3: 
arg 4: .247341863143735
arg 5: 10
arg 6: 0
arg 7: 1
arg 8: 11
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = smap

force compute = 0

missing distance = 0.247342

number of variables in manifold = 10

train set obs: 124
predict set obs: 124

p_manifold flag = 0

l = 9

columns in smap coefficents = 11
save_mode = 1

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 26, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 9
arg 2: smap
arg 3: 
arg 4: .247341863143735
arg 5: 10
arg 6: 0
arg 7: 1
arg 8: 11
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = smap

force compute = 0

missing distance = 0.247342

number of variables in manifold = 10

train set obs: 150
predict set obs: 150

p_manifold flag = 0

l = 9

columns in smap coefficents = 11
save_mode = 1

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l.x
Additional variables in the embedding: u (+ time delta)
Missing values are assumed to have a distance of .25 with all values.
-------------------------------------------------------------------
          Mapping    Library size             rho             MAE
-------------------------------------------------------------------
   l.x ~ l.x|M(x)             124          .88581         .056787 
     x ~ x|M(l.x)             150          .22176          .30935 
-------------------------------------------------------------------
Note: The embedding dimension E is 10 (including 5 extras)
Note: Embedding includes the delta of the time variable with a weight of .55 and .54

. 
. edm xmap x l3.x, extraembed(u) allowmissing dt alg(smap) savesmap(newc) e(5) oneway dtsave(testdt)

====================
Start of the plugin

number of vars & obs = 26, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 9
arg 2: smap
arg 3: 
arg 4: .247341863143735
arg 5: 10
arg 6: 0
arg 7: 1
arg 8: 11
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = smap

force compute = 0

missing distance = 0.247342

number of variables in manifold = 10

train set obs: 123
predict set obs: 123

p_manifold flag = 0

l = 9

columns in smap coefficents = 11
save_mode = 1

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and l3.x
Additional variables in the embedding: u (+ time delta)
Missing values are assumed to have a distance of .25 with all values.
---------------------------------------------------------------------
            Mapping    Library size             rho             MAE
---------------------------------------------------------------------
   l3.x ~ l3.x|M(x)             123          .69907         .075825 
---------------------------------------------------------------------
Note: The embedding dimension E is 10 (including 5 extras)
Note: Embedding includes the delta of the time variable with a weight of .55

. 
. edm explore x, extraembed(u) allowmissing dt crossfold(5)
5-fold cross-validation progress (5 in total)

====================
Start of the plugin

number of vars & obs = 9, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 4
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 4

train set obs: 120
predict set obs: 29

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 9, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 4
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 4

train set obs: 119
predict set obs: 30

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 9, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 4
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 4

train set obs: 119
predict set obs: 30

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 9, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 4
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 4

train set obs: 119
predict set obs: 30

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 9, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 5
arg 2: simplex
arg 3: 
arg 4: .247341863143735
arg 5: 4
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.247342

number of variables in manifold = 4

train set obs: 119
predict set obs: 30

p_manifold flag = 0

l = 5

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.

Empirical Dynamic Modelling
Multivariate mapping with x and its lag values
Additional variables in the embedding: u (+ time delta)
Missing values are assumed to have a distance of .25 with all values.
----------------------------------------------------------------------
                      --------- rho ---------  --------- MAE ---------
 Actual E    theta         Mean    Std. Dev.         Mean    Std. Dev.
----------------------------------------------------------------------
        4        1       .62918      .085112       .12219      .020361
----------------------------------------------------------------------
Note: Results from 5 runs
Note: Actual E is higher than the specified E due to extras
Note: Number of neighbours (k) is set to E+3
Note: 5-fold cross validation results reported
Note: Embedding includes the delta of the time variable with a weight of .55

. 
. edm explore d.x, dt

====================
Start of the plugin

number of vars & obs = 8, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 4
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 3
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 3

train set obs: 53
predict set obs: 53

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Multivariate mapping with d.x and its lag values
Additional variables in the embedding: (time delta)
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 3               1          .78058          .15644 
--------------------------------------------------------------------
Note: Actual E is higher than the specified E due to extras
Note: Number of neighbours (k) is set to E+2
Note: Random 50/50 split for training and validation data
Note: Embedding includes the delta of the time variable with a weight of .27

. 
. 
. edm explore x, rep(20) ci(95)
Replication progress (20 in total)

====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 38
predict set obs: 39

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
----------------------------------------------------------------------
                      --------- rho ---------  --------- MAE ---------
 Actual E    theta         Mean    Std. Dev.         Mean    Std. Dev.
----------------------------------------------------------------------
        2        1       .99571     .0045792      .013297     .0039025
  Est. mean 95% CI   [   .99357,    .99785 ]   [   .01147,   .015123 ]
2.5/97.5 Pc (Est.)   [   .98673,    1.0047 ]   [ .0056481,   .020946 ]
2.5/97.5 Pc (Obs.)   [   .98346,    .99887 ]   [ .0085166,   .024075 ]
----------------------------------------------------------------------
Note: Results from 20 runs
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm xmap x y, lib(50) rep(20) ci(95)
Replication progress (40 in total)

====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 108

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.
====================
Start of the plugin

number of vars & obs = 7, 182
first and last obs in sample = 1, 182

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 50
predict set obs: 123

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================

.

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping        Lib size        Mean rho       Std. Dev.
---------------------------------------------------------------
   y ~ y|M(x)              50          .37281         .068293
  Est. mean 95% CI                    [   .34085,    .40477 ]
2.5/97.5 Pc (Est.)                    [   .23896,    .50666 ]
2.5/97.5 Pc (Obs.)                    [   .25678,    .49079 ]
   x ~ x|M(y)              50          .86316         .024202
  Est. mean 95% CI                    [   .85183,    .87448 ]
2.5/97.5 Pc (Est.)                    [   .81572,    .91059 ]
2.5/97.5 Pc (Obs.)                    [   .80334,    .89799 ]
---------------------------------------------------------------
Note: Results from 20 replications
Note: The embedding dimension E is 2

. 
. use `basedata', clear

. cap drop x_copy

. cap drop x_p

. cap drop xc_p

. clonevar x_copy = x

. edm explore x, predict(x_p) copredict(xc_p) copredictvar(x_copy) full

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 199

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 200

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99939        .0049147 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. assert x_p!=. if _n!=1 & _n!=_N

. assert xc_p!=. if _n!=1 & _n!=_N

. assert x_p ==xc_p if x_p!=.

. cor x_p f.x
(obs=199)

             |                 F.
             |      x_p        x
-------------+------------------
         x_p |   1.0000
           x |
         F1. |   0.9994   1.0000


. cor xc_p f.x
(obs=199)

             |                 F.
             |     xc_p        x
-------------+------------------
        xc_p |   1.0000
           x |
         F1. |   0.9994   1.0000


. 
. cap drop x_p xc_p

. edm explore x, predict(x_p) copredict(xc_p) copredictvar(x_copy) full tp(2)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 198
predict set obs: 198

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 198
predict set obs: 200

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99877        .0078776 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. sum x_p xc_p

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         x_p |        198    .6434232    .2159587   .3039276   .8967989
        xc_p |        200    .6436226    .2154685   .3039276   .8967989

. assert xc_p!=. if x_p!=.

. 
. 
. gen y_copy = y

. edm xmap x y, tp(10) copredict(xmap_y_p) copredictvar(x_copy y_copy) direction(oneway) predict(xmap_y)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 190
predict set obs: 190

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 190
predict set obs: 200

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             190          .30665          .15441 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. assert xmap_y_p !=. if _n>1

. assert xmap_y_p == xmap_y if xmap_y !=.

. 
. preserve

. drop if mod(t,17)==1
(12 observations deleted)

. //copredict with dt
. edm xmap x y, dt copredict(xmap_y_p_dt) copredictvar(x_copy y_copy) direction(oneway) predict(xmap_y_dt)

====================
Start of the plugin

number of vars & obs = 8, 189
first and last obs in sample = 1, 189

arg 0: 1
arg 1: 4
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 3
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 3

train set obs: 188
predict set obs: 188

p_manifold flag = 0

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 11, 189
first and last obs in sample = 1, 189

arg 0: 1
arg 1: 4
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 3
arg 6: 1
arg 7: 0
arg 8: 3
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 3

train set obs: 188
predict set obs: 188

p_manifold flag = 1
number of variables in p_manifold = 3

l = 4

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
Additional variables in the embedding: (time delta)
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             188          .51527          .13499 
---------------------------------------------------------------
Note: The embedding dimension E is 3 (including 1 extra)
Note: Embedding includes the delta of the time variable with a weight of .88

. assert xmap_y_p_dt !=. if _n>1

. assert xmap_y_p_dt == xmap_y_dt if xmap_y_dt !=.

. 
. edm explore x, predict(predicted_x_dt) copredict(predicted_x_copy_dt) copredictvar(x_copy) full

====================
Start of the plugin

number of vars & obs = 7, 189
first and last obs in sample = 1, 189

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 163
predict set obs: 163

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 189
first and last obs in sample = 1, 189

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 163
predict set obs: 176

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99928        .0054303 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. 
. assert predicted_x_dt == predicted_x_copy_dt if predicted_x_dt!=.

. 
. restore

. 
. 
. edm explore x, copredict(dx2) copredictvar(d.x)

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 99
predict set obs: 100

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 199

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99847        .0089172 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. 
. edm explore x, predict(predicted_x) copredict(predicted_y_from_mx) copredictvar(y) full

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 199

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


====================
Start of the plugin

number of vars & obs = 9, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 1
arg 7: 0
arg 8: 2
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 200

p_manifold flag = 1
number of variables in p_manifold = 2

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99939        .0049147 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. edm explore y, predict(predicted_y) full

====================
Start of the plugin

number of vars & obs = 7, 201
first and last obs in sample = 1, 201

arg 0: 1
arg 1: 3
arg 2: simplex
arg 3: 
arg 4: 0
arg 5: 2
arg 6: 0
arg 7: 0
arg 8: 0
arg 9: 4
arg 10: 1

theta = 1.0000

algorithm = simplex

force compute = 0

missing distance = 0.000000

number of variables in manifold = 2

train set obs: 199
predict set obs: 199

p_manifold flag = 0

l = 3

save_mode = 0

Requested 4 OpenMP threads
Using 4 OpenMP threads


End of the plugin
====================


Empirical Dynamic Modelling
Univariate mapping with y and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99279          .01359 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Full sample used for the computation

. cor f.x f.y predicted_x predicted_y predicted_y_from_mx
(obs=199)

             |        F.       F.                           
             |        x        y predi~_x predic~y predi~mx
-------------+---------------------------------------------
           x |
         F1. |   1.0000
           y |
         F1. |   0.3545   1.0000
 predicted_x |   0.9994   0.3467   1.0000
 predicted_y |   0.3618   0.9928   0.3540   1.0000
predicted~mx |   0.1334   0.7831   0.1217   0.7850   1.0000


. cor f.x predicted_x
(obs=199)

             |        F.         
             |        x predi~_x
-------------+------------------
           x |
         F1. |   1.0000
 predicted_x |   0.9994   1.0000


. assert r(rho)>0.99

. cor f.y predicted_y
(obs=199)

             |        F.         
             |        y predic~y
-------------+------------------
           y |
         F1. |   1.0000
 predicted_y |   0.9928   1.0000


. assert r(rho)>0.99

. cor f.y predicted_y_from_mx
(obs=199)

             |        F.         
             |        y predi~mx
-------------+------------------
           y |
         F1. |   1.0000
predicted~mx |   0.7831   1.0000


. assert r(rho)>0.7

. 
. * Obtaining CI of the xmap
. jackknife: edm xmap x y, e(2)
(running edm on estimation sample)

Jackknife replications (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200

Empirical Dynamic Modelling
Convergent Cross-mapping result for variables x and y
---------------------------------------------------------------
      Mapping    Library size             rho             MAE
---------------------------------------------------------------
   y ~ y|M(x)             200          .54213          .13182 
   x ~ x|M(y)             200          .94272         .048213 
---------------------------------------------------------------
Note: The embedding dimension E is 2

. ereturn display
------------------------------------------------------------------------------
             |              Jackknife
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      y|M(x) |    .542135   .0914957     5.93   0.000     .3617095    .7225605
      x|M(y) |   .9427227   .0140109    67.29   0.000     .9150939    .9703515
------------------------------------------------------------------------------

. 
. jackknife: edm explore x, e(2)
(running edm on estimation sample)

Jackknife replications (199)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
.................................................

Empirical Dynamic Modelling
Univariate mapping with x and its lag values
--------------------------------------------------------------------
          Actual E           theta             rho             MAE
--------------------------------------------------------------------
                 2               1          .99846        .0083042 
--------------------------------------------------------------------
Note: Number of neighbours (k) is set to E+1
Note: Random 50/50 split for training and validation data

. ereturn display
------------------------------------------------------------------------------
             |              Jackknife
             |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
           x |   .9984628   .0106503    93.75   0.000     .9774601    1.019465
------------------------------------------------------------------------------

. 
. cap log close _all
